{
  "backend/main.mo": "Empty Motoko actor placeholder with no logic.",
  "feature_evidence.json": "Feature evidence report describing two frontend tasks related to adding complete service images and premium assets.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for numerous frontend components, pages, and utilities.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH color variables for light/dark themes and applying background/foreground rules.",
  "frontend/index.html": "Static HTML entry with SEO metadata, OG/Twitter tags, and script bootstrap for the React app.",
  "frontend/public/_redirects": "Netlify redirect rule routing all paths to index.html for SPA behavior.",
  "frontend/src/App.tsx": "Main Router setup using TanStack Router with five routes wrapped in SiteLayout.",
  "frontend/src/components/BrandLogo.tsx": "Brand logo component displaying the salon logo image with styled text.",
  "frontend/src/components/ContactActions.tsx": "Contact action list rendering phone and WhatsApp buttons from business details.",
  "frontend/src/components/CtaButtons.tsx": "CTA button group for booking via WhatsApp or calling directly.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Fixed floating WhatsApp action button linking to the first WhatsApp number.",
  "frontend/src/components/GalleryGrid.tsx": "Responsive grid that renders gallery images with hover zoom animation.",
  "frontend/src/components/MobileStickyCallBar.tsx": "Mobile-only fixed call bar at screen bottom using the primary phone number.",
  "frontend/src/components/Section.tsx": "Layout wrapper component applying consistent vertical spacing and container width.",
  "frontend/src/components/Seo.tsx": "Runtime SEO utility that updates document title, description, and canonical link.",
  "frontend/src/components/ServiceCard.tsx": "Service card showing optional image, details, price, and a WhatsApp booking button.",
  "frontend/src/components/SiteFooter.tsx": "Footer with brand info, navigation links, contact details, and Instagram/social attribution.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with logo, desktop nav links, and a toggleable mobile menu.",
  "frontend/src/components/SiteLayout.tsx": "Main layout wrapping pages with header, footer, and utility components.",
  "frontend/src/data/gallery.ts": "Exports an array of gallery image metadata for the salon.",
  "frontend/src/data/services.ts": "Defines service categories and detailed service listings with prices and images.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout functions, and identity loading logic.",
  "frontend/src/index.css": "Tailwind base styles with custom theme variables and animation utilities.",
  "frontend/src/lib/businessDetails.ts": "Static business info including name, address, phone numbers, and social links.",
  "frontend/src/lib/contactLinks.ts": "Utility functions to generate tel and WhatsApp links from phone numbers.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, identity provider, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "About page showing the salon’s story, values, and SEO metadata.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact page with hero text, location details, social link, contact actions, and an embedded Google Map.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a gallery page with a hero section and a grid of images via GalleryGrid.",
  "frontend/src/pages/HomePage.tsx": "Implements the home page with a hero banner, feature cards, and CTA sections promoting grooming services.",
  "frontend/src/pages/ServicesPage.tsx": "Generates the services page by rendering hero text and mapping service categories into ServiceCard grids.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container queries, animations, and theme extensions.",
  "project_state.json": "Defines the project's current state, requirements, architecture notes, image needs, and existing feature records."
}